/*
n = a + (a+1) + (a+2) + ... + (a+k-1) ; k พจน์

ซึ่งสามารถเขียนเป็น:
n = k*a + (0 + 1 + 2 + ... + k-1)
n = k*a + k*(k-1)/2

จัดรูปใหม่ได้:
k*a = n - k*(k-1)/2

เงื่อนไข:
n - k*(k-1)/2 > 0 (ต้องเป็นจำนวนบวก)
(n - k*(k-1)/2) % k == 0 (ต้องหาร k ลงตัว)
*/

int consecutiveNumbersSum(int n) {
    int ans = 0;
        
    // k = จำนวนพจน์
    for (int k = 1; k * (k + 1) <= 2 * n; k++) {
        if ((2 * n - k * (k - 1)) % (2 * k) == 0) {
            ans++;
        }
    }
        
    return ans;
}