impl Solution {
    pub fn super_egg_drop(k: i32, n: i32) -> i32 {
        if k == 1 { return n; } // ไข่ฟองเดียวต้องทดลองทีละชั้น
        if n == 1 { return 1; } // มีชั้นเดียวทดลองครั้งเดียวพอ
        
        let mut left = 1;
        let mut right = n;
        
        // Binary search ด้วย move ที่ทดสอบ
        while left < right {
            let mid = left + (right - left) / 2;
            let mut sum: i64 = 0; // จำนวนชั้นที่สามารถทดสอบได้โดยใช้ mid moves กับ k eggs
            let mut term: i64 = 1;  // C(mid,0)
/*
            จำนวน f ที่เป็นไปได้ = รูปแบบการทดลองที่เป็นไปได้ทั้งหมด
            f(m, k) = C(m,0) + C(m,1) + C(m,2) + ... + C(m,k) = 1 + nชั้น
            C(m,i) = จำนวนวิธีเลือก i ครั้งจาก m ครั้ง ที่ไข่จะแตก = m! / (i! * (m-i)!)
            C(m,i) = C(m, i-1) * (m - i + 1) / i
            
            move = 3 , k = 2, B = ไข่แตก, N = ไข่ไม่แตก
            BBN	ทดลองที่3→แตก, ทดลองที่1→แตก,   ชั้น 1 (f=0) (นับทุกความเป็นไปได้โดยไม่สนว่าจบเร็วกว่า mid ครั้งหรือไม่ แต่ในโลกจริงถ้าไข่หมดก่อน m ครั้ง การทดลองหยุด BBx)
            BNB	ทดลองที่3→แตก, ทดลองที่1→ไม่แตก, ทดลองที่2→แตก	(f=1)
            BNN	ทดลองที่3→แตก, ทดลองที่1→ไม่แตก, ทดลองที่2→ไม่แตก	(f=2)
            NBB	ทดลองที่3→ไม่แตก, ทดลองที่5→แตก, ทดลองที่4→แตก	(f=3)
            NBN	ทดลองที่3→ไม่แตก, ทดลองที่5→แตก, ทดลองที่4→ไม่แตก	(f=4)
            NNB	ทดลองที่3→ไม่แตก, ทดลองที่5→ไม่แตก, ทดลองที่6→แตก	(f=5)
            NNN ทดลองที่3→ไม่แตก, ทดลองที่5→ไม่แตก, ทดลองที่6→ไม่แตก	(f=6)
*/
            for i in 1..=k {
                term = term * (mid - i + 1) as i64 / i as i64;
                sum += term;
                if sum >= n as i64 {
                    break;
                }
            }
            
            if sum >= n as i64 { // ชั้นมากกว่าที่ต้องการ
                right = mid;
            } else { // ชั้นน้อยกว่าที่ต้องการ
                left = mid + 1;
            }
        }
        
        left
    }
}