/*
2, 3, 4, 4, 2, 2, 4 = 3 (011)
2 - 010
3 - 011
4 - 100
one เก็บบิต 1 ที่ปรากฎมาหนึ่งครั้ง 
โดยจะเปลี่ยนให้ตำแหน่งนั้นใน one เป็น 0 หากปรากฎเป็นครั้งที่สอง
two เก็บบิต 1 ที่ปรากฎมาสองครั้ง 
ถ้าพบเป็นครั้งที่สามตำแหน่งบิต 1 นั้นใน two จะเป็น 0 แต่ไม่เพิ่มลง one เพราะเราใช้ (!two บิตที่ปรากฎสองครั้งมาก่อนในรอบก่อนหากพบอีกครั้งในรอบนี้จะไม่พิจารณาใน one)

ไล่ดูทีละตัวมา XOR ถ้า 0 ^ 1 หรือ 1 ^ 0 จะเป็น 1
พิจารณา one เฉพาะตำแหน่งที่ไม่ปรากฎครบสองครั้ง (!two จากรอบที่แล้ว)
พิจารณา two เฉพาะตำแหน่งที่ปรากฎสองครั้ง (!one จากรอบนี้)
*/
impl Solution {
    pub fn single_number(nums: Vec<i32>) -> i32 {
        let mut one = 0;
        let mut two = 0;
        
        for n in nums {
            one = (one ^ n) & !two;
            two = (two ^ n) & !one;
        }
        
        one
    }
}