class Solution {
public:
    int maxEnvelopes(vector<vector<int>>& envelopes) {
        // เรียงลำดับ envelopes
        sort(envelopes.begin(), envelopes.end(), [](const vector<int>& a, const vector<int>& b) {
            return a[0] == b[0] ? a[1] > b[1] : a[0] < b[0];
        });
        
        vector<int> lis;
        for (const auto& env : envelopes) {
            int h = env[1];
            auto it = lower_bound(lis.begin(), lis.end(), h);
            if (it == lis.end()) {
                lis.push_back(h);
            } else {
                *it = h;
            }
        }
        
        return lis.size();
    }
};

/*
ทำการเรียงตามความกว้างจากน้อยไปมากโดยถ้าหากมีความกว้างเท่ากันจากเรียงตามความสูงมากไปน้อย 
จากนั้นสร้างอาเรย์หนึ่งตัวเพื่อไว้เก็บความสูงซึ่งขนาดของอาเรย์จะเป็นคำตอบ 
เมื่อไล่ที่ละสมาชิกการตัดสินใจใส่ความสูงลงไปในอาเรย์ให้ใช้ binary search เพื่อลดเวลา หากไม่พบค่าที่มากกว่าให้เพิ่มค่านั้นลงไปแต่หากพบค่าที่มากกว่าให้แทนด้วยค่าใหม่ซึ่งอาจให้ผลลัพธ์ที่ดีกว่า

ตัวอย่างเมื่อเรียงแล้ว:
[[2,14], [2,5], [2,3], [5,4], [5,1], [6,7], [6,3], [7,5],[10,6]]
อาเรย์เก็บความสูงเมื่อวนลูปแต่ละรอบ:
[14] เลือก [2,14]
[5] เลือก [2,5]
[3] เลือก [2,3]
[3,4] เลือก [2,3], [5,4]
[1,4] เลือก [2,3], [5,4] หรือ [5,1], ... ซึ่งอาจได้ผลลัพธ์ที่ดีกว่า
[1,4,7] เลือก [2,3], [5,4], [6,7] หรือ [5,1], ... ซึ่งอาจให้ผลลัพธ์ที่ดีกว่า
[1,3,7] เลือก [2,3], [5,4], [6,7] หรือ [5,1], [6,3], ... ซึ่งอาจให้ผลลัพธ์ที่ดีกว่า
[1,3,5] เลือก [5,1], [6,3], [7,5]
[1,3,5,6] เลือก [5,1], [6,3], [7,5], [10,6]
การที่เราเรียงความสูงจากมากไปน้อยหากความกว้างเท่ากันทำให้จะไม่มีการเลือกความกว้างเท่ากันเช่น [2,3], [2,5] มาด้วยกัน
*/