/*
f(n = 1) = 1 
f(n = 2) = 0.5 

ถ้าคนแรกไปนั่งที่ตัวเองจะได้นั่งแน่ๆ: 1/n
ถ้าคนแรกนั่งที่นั่งคนที่ n จะไม่มีทางได้นั่งที่ตัวเอง: 1/n
ถ้าคนแรกไปนั่งที่นั่งคนที่ 1 < i < n : 1/(n-2)
จะเสมือนว่าเราเริ่มต้นปัญหาเดิมด้วยขนาดที่เล็กลงเป็นการพิจารณาให้คนที่ i สุ่มไปนั่งที่คนอื่นเรื่อยๆ(ที่นั่งคนแรกก็ยังว่างอยู่ เหมือนเป็นคนแรกคนใหม่)
*/

impl Solution {
    pub fn nth_person_gets_nth_seat(n: i32) -> f64 {
        if n == 1 {
            return 1.0;
        } else {
            return 0.5;
        }
    }
}